In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data

import env
import acquire

# Load pydataset `Iris`

In [2]:
df_iris = data('iris')

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
df_iris.shape

(150, 5)

In [5]:
print(df_iris.columns)

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [6]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

recommend resclaing the data bases on output???

# Load `Table1_CustDetails` from excel spreadsheet `Spreadsheets_Exercises.xlsx` into dataframe `df_excel`

In [7]:
df_excel = pd.read_excel('Spreadsheets_Exercises.xlsx', sheet_name='Table1_CustDetails')
df_excel

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.60,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.90,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.90,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.00,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.90,267.40,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...
7044,9987-LUTYD,Female,0,No,No,1,1,1,Mailed check,55.15,742.90,No
7045,9992-RRAMN,Male,0,Yes,No,2,2,0,Electronic check,85.10,1873.70,Yes
7046,9992-UJOEL,Male,0,No,No,1,1,0,Mailed check,50.30,92.75,No
7047,9993-LHIEB,Male,0,Yes,Yes,1,1,2,Mailed check,67.85,4627.65,No
7048,9995-HOTOH,Male,0,Yes,Yes,0,1,2,Electronic check,59.00,3707.60,No

In [8]:
# df_example_sample = df_excel[0:101]
df_example_sample = df_excel.head(101)
df_example_sample.head(10)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.60,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.90,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.90,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.00,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.90,267.40,Yes
5,0013-MHZWF,Female,0,No,Yes,1,1,0,Credit card (automatic),69.40,571.45,No
6,0013-SMEOE,Female,1,Yes,No,1,2,2,Bank transfer (automatic),109.70,7904.25,No
7,0014-BMAQU,Male,0,Yes,No,2,2,2,Credit card (automatic),84.65,5377.80,No
8,0015-UOCOJ,Female,1,No,No,1,1,0,Electronic check,48.20,340.35,No
9,0016-QLJIS,Female,0,Yes,Yes,2,1,2,Mailed check,90.45,5957.90,No

In [9]:
df_example_sample.shape

(101, 12)

In [10]:
print(df_example_sample.iloc[0,:5])

customer_id          0002-ORFBO
gender                   Female
is_senior_citizen             0
partner                     Yes
dependents                  Yes
Name: 0, dtype: object

In [11]:
df_example_sample.select_dtypes('object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [12]:
# can also do this to get the column names that only have a object data type
pd.Series(df_example_sample.select_dtypes(object).columns)

0     customer_id
1          gender
2         partner
3      dependents
4    payment_type
5           churn
dtype: object

In [13]:
df_example_sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        101 non-null    object
 1   gender             101 non-null    object
 2   is_senior_citizen  101 non-null    int64
 3   partner            101 non-null    object
 4   dependents         101 non-null    object
 5   phone_service      101 non-null    int64
 6   internet_service   101 non-null    int64
 7   contract_type      101 non-null    int64
 8   payment_type       101 non-null    object
 9   monthly_charges    101 non-null    float64
 10  total_charges      101 non-null    float64
 11  churn              101 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 9.6+ KB

# create a range of numerical variables

- to do this we can use the following `pandas.DataFrame( data, index, columns, dtype, copy)`

https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm

In [14]:
pd.DataFrame({'min': df_example_sample.select_dtypes([int, float]).min(),
             'max': df_example_sample.select_dtypes([int, float]).max()})

                     min     max
is_senior_citizen   0.00     1.0
phone_service       0.00     2.0
internet_service    0.00     2.0
contract_type       0.00     2.0
monthly_charges    19.40   116.8
total_charges      19.85  8496.7

# Reading data into pandas from a google sheet

- https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit?usp=sharing

In [15]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

print first 3 rows

In [16]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## print number of rows and columns

In [17]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## print data type of each column

In [18]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## print the summary statistics for each of the numeric variables

In [19]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## print the unique values for each of your categorical variables

In [20]:
df_google.select_dtypes(object).columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [21]:
pd.Series(df_google.Name.unique())

0                                  Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Thayer)
2                                   Heikkinen, Miss. Laina
3             Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                                 Allen, Mr. William Henry
                              ...
886                                  Montvila, Rev. Juozas
887                           Graham, Miss. Margaret Edith
888               Johnston, Miss. Catherine Helen "Carrie"
889                                  Behr, Mr. Karl Howell
890                                    Dooley, Mr. Patrick
Length: 891, dtype: object

In [22]:
pd.Series(df_google.Sex.unique())

0      male
1    female
dtype: object

In [23]:
pd.Series(df_google.Ticket.unique())

0             A/5 21171
1              PC 17599
2      STON/O2. 3101282
3                113803
4                373450
             ...
676     SOTON/OQ 392076
677              211536
678              112053
679              111369
680              370376
Length: 681, dtype: object

In [24]:
pd.Series(df_google.Cabin.unique())

0                  NaN
1                  C85
2                 C123
3                  E46
4                   G6
5                 C103
6                  D56
7                   A6
8          C23 C25 C27
9                  B78
10                 D33
11                 B30
12                 C52
13                 B28
14                 C83
15                 F33
16               F G73
17                 E31
18                  A5
19             D10 D12
20                 D26
21                C110
22             B58 B60
23                E101
24               F E69
25                 D47
26                 B86
27                  F2
28                  C2
29                 E33
30                 B19
31                  A7
32                 C49
33                  F4
34                 A32
35                  B4
36                 B80
37                 A31
38                 D36
39                 D15
40                 C93
41                 C78
42                 D35
43                 C87
44                 B77
45                 E67
46                 B94
47                C125
48                 C99
49                C118
50                  D7
51                 A19
52                 B49
53                   D
54             C22 C26
55                C106
56                 C65
57                 E36
58                 C54
59     B57 B59 B63 B66
60                  C7
61                 E34
62                 C32
63                 B18
64                C124
65                 C91
66                 E40
67                   T
68                C128
69                 D37
70                 B35
71                 E50
72                 C82
73             B96 B98
74                 E10
75                 E44
76                 A34
77                C104
78                C111
79                 C92
80                 E38
81                 D21
82                 E12
83                 E63
84                 A14
85                 B37
86                 C30
87                 D20
88                 B79
89                 E25
90                 D46
91                 B73
92                 C95
93                 B38
94                 B39
95                 B22
96                 C86
97                 C70
98                 A16
99                C101
100                C68
101                A10
102                E68
103                B41
104                A20
105                D19
106                D50
107                 D9
108                A23
109                B50
110                A26
111                D48
112                E58
113               C126
114                B71
115        B51 B53 B55
116                D49
117                 B5
118                B20
119              F G63
120            C62 C64
121                E24
122                C90
123                C45
124                 E8
125               B101
126                D45
127                C46
128                D30
129               E121
130                D11
131                E77
132                F38
133                 B3
134                 D6
135            B82 B84
136                D17
137                A36
138               B102
139                B69
140                E49
141                C47
142                D28
143                E17
144                A24
145                C50
146                B42
147               C148
dtype: object

In [25]:
pd.Series(df_google.Embarked.unique())

0      S
1      C
2      Q
3    NaN
dtype: object

# Classification: Data Prep

In [60]:
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import numpy as np

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

import env
import acquire

In [61]:
df_iris = acquire.get_iris_data()

In [62]:
df_iris.head(3)

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2

# Exercises
The end product of this exercise should be the specified functions in a python script named `prepare.py`. Do these in your `classification_exercises.ipynb` first, then transfer to the `prepare.py file`.

1. Iris Data

a. Use the function defined in `acquire.py` to load the iris data.

In [63]:
df_iris = acquire.get_iris_data()

In [64]:
df_iris.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [68]:
df_iris.dtypes

species_id        int64
species          object
sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
dtype: object

b. Drop the `species_id` and `measurement_id` columns.

In [65]:
# df_iris.drop(columns=['species_id', 'measurement_id']) 
# SQL query does not have these items

c. Rename the `species_name` column to just `species`.

In [66]:
df_iris.rename(columns = {'species_name': 'species'}, inplace = True)
df_iris.head()

   species_id species  sepal_length  sepal_width  petal_length  petal_width
0           1  setosa           5.1          3.5           1.4          0.2
1           1  setosa           4.9          3.0           1.4          0.2
2           1  setosa           4.7          3.2           1.3          0.2
3           1  setosa           4.6          3.1           1.5          0.2
4           1  setosa           5.0          3.6           1.4          0.2

d. Encode the species name using a sklearn label encoder.

In [33]:
encoder = LabelEncoder()

In [34]:
encoder.fit(df_iris.species)

LabelEncoder()

In [35]:
# transform the data with the encoder object
df_iris.species = encoder.transform(df_iris.species)

In [36]:
# Look at the values count with the transformed data
df_iris.species.value_counts()

2    50
1    50
0    50
Name: species, dtype: int64

In [37]:
df_iris.species = pd.Series(encoder.inverse_transform(df_iris.species))

Research the `inverse_transform` method of the label encoder.

the use of `inverse_transform` takes data that was changed and reverts it back to it;s original format

How might this be useful?

e. Create a function named `prep_iris` that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [38]:
def prep_iris():
    df_iris = acquire.get_iris_data()
    df_iris.rename(columns = {'species_name': 'species'}, inplace = True)
    encoder = LabelEncoder()
    encoder.fit(df_iris.species)
    df_iris.species = encoder.transform(df_iris.species)
    return df_iris

In [39]:
df_iris = prep_iris()

In [40]:
df_iris.head()

   species_id  species  sepal_length  sepal_width  petal_length  petal_width
0           1        0           5.1          3.5           1.4          0.2
1           1        0           4.9          3.0           1.4          0.2
2           1        0           4.7          3.2           1.3          0.2
3           1        0           4.6          3.1           1.5          0.2
4           1        0           5.0          3.6           1.4          0.2

2. Titanic Data

a. Use the function you defined in `acquire.py` to load the titanic data set.

In [41]:
df_titanic = acquire.get_titanic_data()
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [42]:
# shape
df_titanic.shape

(891, 13)

In [43]:
df_titanic.head(2)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0

In [44]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [45]:
pd.crosstab(df_titanic.embarked, df_titanic.embark_town)

embark_town  Cherbourg  Queenstown  Southampton
embarked
C                  168           0            0
Q                    0          77            0
S                    0           0          644

In [46]:
pd.crosstab(df_titanic['pclass'], df_titanic['class'])

class   First  Second  Third
pclass
1         216       0      0
2           0     184      0
3           0       0    491

- embarked and ebark_town are directly correlated
- pclass and class are directly correlated

b. Handle the missing values in the `embark_town` and `embarked` columns.

In [47]:
# drop any rows that have na
df_titanic.dropna()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
6,6,0,1,male,54.0,0,0,51.8625,S,First,E,Southampton,1
10,10,1,3,female,4.0,1,1,16.7000,S,Third,G,Southampton,0
11,11,1,1,female,58.0,0,0,26.5500,S,First,C,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,871,1,1,female,47.0,1,1,52.5542,S,First,D,Southampton,0
872,872,0,1,male,33.0,0,0,5.0000,S,First,B,Southampton,1
879,879,1,1,female,56.0,0,1,83.1583,C,First,C,Cherbourg,0
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1

c. Remove the `deck` column.

In [48]:
# df_titanic = df_titanic.drop(columns='embarked')
# df_titanic = df_titanic.drop(columns='class')
df_titanic = df_titanic.drop(columns='deck')

In [49]:
df_titanic.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1

In [50]:
df_titanic.embarked.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: embarked, Length: 891, dtype: bool

d. Use a label encoder to transform the `embarked` column.

In [51]:
encoder = LabelEncoder()
encoder
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  embark_town   889 non-null    object
 11  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 83.7+ KB

In [52]:
df_titanic['embarked'] = df_titanic.embarked.astype('str')

In [75]:
# encoder.fit(df_iris.species)
# df_titanic.dropna()
df_titanic['embarked'] = encoder.fit_transform(df_titanic.embarked)
df_titanic.embarked.value_counts()

3    644
0    168
2     77
1      2
Name: embarked, dtype: int64

In [72]:
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,3,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,0,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,3,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,3,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,3,Third,Southampton,1

In [ ]:
# need to remember some vocabulary on this section

e. Scale the `age` and `fare` columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

f. Fill the missing values in `age`. The way you fill these values is up to you. Consider the tradeoffs of different methods.

g. Create a function named `prep_titanic` that accepts the untransformed titanic data, and returns the data with the transformations above applied.